fonecmid-diplom/src/DataProcessors/МассовоеСозданиеАктов/МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Договоры</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/DataProcessors/МассовоеСозданиеАктов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создает реализации товаров и услуг по абонентским договорам за указанный месяц.
// Если реализация за месяц по договору уже существует, повторно она не создается.
// Процедура предназначена для выполнения в фоновом задании механизма длительных операций БСП.
//
// Результат работы помещается во временное хранилище по адресу АдресРезультата
// в виде массива структур с полями: Договор (обработанный договор),
// Реализация (созданная или ранее созданная реализация, может быть Неопределено),
// Комментарий (результат обработки договора).
//
// Параметры:
//  Параметры - Структура - параметры создания реализаций:
//   * Период   - Дата - месяц, за который создаются реализации;
//   * Договоры - Массив из СправочникСсылка.ДоговорыКонтрагентов - абонентские договоры.
//  АдресРезультата - Строка - адрес временного хранилища, в которое помещается результат.
//
Процедура СоздатьРеализации(Параметры, АдресРезультата) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СуществующиеРеализации = НайтиРеализацииЗаМесяц(Параметры.Договоры, Параметры.Период);
	СведенияОДоговорах = ПолучитьСведенияОДоговорах(Параметры.Договоры);
	
	Результат = Новый Массив;
	ВсегоДоговоров = Параметры.Договоры.Количество();
	ОбработаноДоговоров = 0;
	
	Для Каждого Договор Из Параметры.Договоры Цикл
		
		Попытка
			СтрокаРезультата = СоздатьРеализациюПоДоговору(Договор, Параметры.Период,
				СуществующиеРеализации[Договор], СведенияОДоговорах[Договор]);
		Исключение
			СтрокаРезультата = Новый Структура("Реализация, Комментарий");
			СтрокаРезультата.Комментарий = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
		
		СтрокаРезультата.Вставить("Договор", Договор);
		Результат.Добавить(СтрокаРезультата);
		
		ОбработаноДоговоров = ОбработаноДоговоров + 1;
		ДлительныеОперации.СообщитьПрогресс(ОбработаноДоговоров * 100 / ВсегоДоговоров,
			"Обработан договор " + Строка(Договор));
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Создает и проводит реализацию по абонентскому договору за месяц
// либо возвращает ранее созданную реализацию.
// Если при проведении возникла ошибка, реализация записывается без проведения.
//
// Параметры:
//  Договор                - СправочникСсылка.ДоговорыКонтрагентов - абонентский договор;
//  Период                 - Дата - месяц, за который создается реализация;
//  СуществующаяРеализация - ДокументСсылка.РеализацияТоваровУслуг, Неопределено - ранее созданная реализация;
//  СведенияОДоговоре      - Структура, Неопределено - контрагент и организация договора:
//   * Контрагент  - СправочникСсылка.Контрагенты - владелец договора;
//   * Организация - СправочникСсылка.Организации - организация договора.
//
// Возвращаемое значение:
//  Структура:
//   * Реализация  - ДокументСсылка.РеализацияТоваровУслуг, Неопределено - созданная или ранее созданная реализация;
//   * Комментарий - Строка - результат обработки договора.
//
Функция СоздатьРеализациюПоДоговору(Договор, Период, СуществующаяРеализация, СведенияОДоговоре)
	
	Результат = Новый Структура("Реализация, Комментарий", Неопределено, "");
	
	Если ЗначениеЗаполнено(СуществующаяРеализация) Тогда
		Результат.Реализация = СуществующаяРеализация;
		Результат.Комментарий = "Реализация уже создана ранее";
		Возврат Результат;
	КонецЕсли;
	
	Если СведенияОДоговоре = Неопределено Тогда
		ВызватьИсключение "Не удалось получить сведения о договоре";
	КонецЕсли;
	
	Реализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	Реализация.Дата = КонецМесяца(Период);
	
	// Стандартный алгоритм заполнения документа (событие ОбработкаЗаполнения).
	Реализация.Заполнить(Неопределено);
	
	Реализация.Контрагент = СведенияОДоговоре.Контрагент;
	Реализация.Организация = СведенияОДоговоре.Организация;
	Реализация.Договор = Договор;
	
	// Заполнение табличной части документа по данным договора.
	Реализация.ВыполнитьАвтозаполнение();
	
	// Стандартный алгоритм проверки заполнения перед проведением.
	// Реквизит Основание (ЗаказПокупателя) по абонентским договорам не заполняется,
	// поэтому его заполнение не проверяется; остальные обязательные реквизиты
	// проверяются отдельно.
	Реализация.ПроверитьЗаполнение();
	
	НезаполненныеРеквизиты = Новый Массив;
	Если Не ЗначениеЗаполнено(Реализация.Организация) Тогда
		НезаполненныеРеквизиты.Добавить("Организация");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Реализация.Контрагент) Тогда
		НезаполненныеРеквизиты.Добавить("Контрагент");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Реализация.Договор) Тогда
		НезаполненныеРеквизиты.Добавить("Договор");
	КонецЕсли;
	
	Если НезаполненныеРеквизиты.Количество() > 0 Тогда
		ВызватьИсключение "Не заполнены обязательные реквизиты документа: "
			+ СтрСоединить(НезаполненныеРеквизиты, ", ");
	КонецЕсли;
	
	// Реализация создается автоматически: основание не указывается,
	// сумма рассчитывается обработчиком ПередЗаписью.
	Реализация.Комментарий = "Отсутствует основание. Создана автоматически. Сумма рассчитана автоматически";
	
	// Если при проведении возникла ошибка, реализация записывается без проведения.
	Попытка
		Реализация.Записать(РежимЗаписиДокумента.Проведение);
		Результат.Комментарий = "Реализация создана и проведена";
	Исключение
		Реализация.Записать(РежимЗаписиДокумента.Запись);
		Результат.Комментарий = "Реализация создана, но не проведена: "
			+ ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Результат.Реализация = Реализация.Ссылка;
	
	Возврат Результат;
	
КонецФункции

// Находит ранее созданные реализации по договорам за указанный месяц.
//
// Параметры:
//  Договоры - Массив из СправочникСсылка.ДоговорыКонтрагентов - абонентские договоры;
//  Период   - Дата - месяц, за который ищутся реализации.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ     - СправочникСсылка.ДоговорыКонтрагентов - договор;
//   * Значение - ДокументСсылка.РеализацияТоваровУслуг - ранее созданная реализация.
//
Функция НайтиРеализацииЗаМесяц(Договоры, Период)
	
	Результат = Новый Соответствие;
	
	Если Договоры.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
		|	РеализацияТоваровУслуг.Договор КАК Договор
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Договор В (&Договоры)
		|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления
		|	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Запрос.УстановитьПараметр("Договоры", Договоры);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(Период));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Договор, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Получает контрагента и организацию по абонентским договорам.
//
// Параметры:
//  Договоры - Массив из СправочникСсылка.ДоговорыКонтрагентов - абонентские договоры.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ     - СправочникСсылка.ДоговорыКонтрагентов - договор;
//   * Значение - Структура - сведения о договоре:
//      ** Контрагент  - СправочникСсылка.Контрагенты - владелец договора;
//      ** Организация - СправочникСсылка.Организации - организация договора.
//
Функция ПолучитьСведенияОДоговорах(Договоры)
	
	Результат = Новый Соответствие;
	
	Если Договоры.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
		|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
		|	ДоговорыКонтрагентов.Организация КАК Организация
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка В (&Договоры)";
	
	Запрос.УстановитьПараметр("Договоры", Договоры);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СведенияОДоговоре = Новый Структура("Контрагент, Организация",
			Выборка.Контрагент, Выборка.Организация);
		Результат.Вставить(Выборка.Ссылка, СведенияОДоговоре);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
